# Pokemon

### Introduction:

This time you will create the data.



### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create a data dictionary that looks like the DataFrame below

In [2]:
raw_data = {
    'evolution': ['Ivysaur', 'Charmeleon', 'Wartortle', 'Metapod'],
    'hp': [45, 39, 44, 45],
    'name': ['Bulbasaur', 'Charmander', 'Squirtle', 'Caterpie'],
    'type': ['grass', 'fire', 'water', 'bug']
}

### Step 3. Assign it to a variable called pokemon

In [4]:
pokemon = pd.DataFrame(raw_data)
pokemon

    evolution  hp        name   type
0     Ivysaur  45   Bulbasaur  grass
1  Charmeleon  39  Charmander   fire
2   Wartortle  44    Squirtle  water
3     Metapod  45    Caterpie    bug

### Step 4. Ops...it seems the DataFrame columns are in alphabetical order. Place  the order of the columns as name, type, hp, evolution, pokedex

In [8]:
pokemon[['name', 'type', 'hp', 'evolution']]

         name   type  hp   evolution
0   Bulbasaur  grass  45     Ivysaur
1  Charmander   fire  39  Charmeleon
2    Squirtle  water  44   Wartortle
3    Caterpie    bug  45     Metapod

### Step 5. Add another column called place, and insert what you have in mind.

In [10]:
pokemon['place'] = ['usa', 'japan', 'egypt', 'ksa']

In [11]:
pokemon

    evolution  hp        name   type  place
0     Ivysaur  45   Bulbasaur  grass    usa
1  Charmeleon  39  Charmander   fire  japan
2   Wartortle  44    Squirtle  water  egypt
3     Metapod  45    Caterpie    bug    ksa

### Step 6. Present the type of each column

In [14]:
pokemon.dtypes

evolution    object
hp            int64
name         object
type         object
place        object
dtype: object

In [15]:
pokemon.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   evolution  4 non-null      object
 1   hp         4 non-null      int64
 2   name       4 non-null      object
 3   type       4 non-null      object
 4   place      4 non-null      object
dtypes: int64(1), object(4)
memory usage: 292.0+ bytes

### BONUS: Create your own question and answer it.

In [16]:
# make type as set index
pokemon.set_index('type')

        evolution  hp        name  place
type
grass     Ivysaur  45   Bulbasaur    usa
fire   Charmeleon  39  Charmander  japan
water   Wartortle  44    Squirtle  egypt
bug       Metapod  45    Caterpie    ksa